[
    {
        "id": "680aa4d219535",
        "title": "ab aaja",
        "category": "unsolved-mysteries",
        "readTime": "6",
        "excerpt": "anbajj",
        "content": "abahaha",
        "tags": "[\"rha\",\"Unsolved Cases\",\"rhr\"]",
        "sources": "bvabvbakj",
        "featuredImage": "1745528018_creek.jpeg",
        "createdAt": "2025-04-24 20:53:38",
        "updatedAt": "2025-04-24 20:53:38",
        "userId": "mh_6806c81e2f7972.38649556",
        "status": "published",
        "comments": [],
        "likes": 0,
        "views": 0,
        "author": "mh_6806c81e2f7972.38649556"
    },
    {
        "id": "680aa5577b1a8",
        "title": "vana",
        "category": "unsolved-mysteries",
        "readTime": "5",
        "excerpt": "vnvnjsvj",
        "content": "vnvajnvaj",
        "tags": "[\"vjava\",\"Unsolved Cases\",\"Cold Cases\"]",
        "sources": "vnvnjasvjvj",
        "featuredImage": "1745528151_creek.jpeg",
        "createdAt": "2025-04-24 20:55:51",
        "updatedAt": "2025-04-24 20:55:51",
        "userId": "mh_6806c81e2f7972.38649556",
        "status": "published",
        "comments": [],
        "likes": 0,
        "views": 0,
        "author": "mh_6806c81e2f7972.38649556"
    },
    {
        "id": "680ae37ed1a81",
        "title": "Whispers in the Library",
        "category": "unsolved-mysteries",
        "readTime": "5",
        "excerpt": "Late at night, books fall from shelves, and no one knows why. Could the library be haunted by more than just history?",
        "content": "The old Kensington Library has been a beloved landmark since 1892, known for its towering shelves and intricate wooden carvings. But beneath its scholarly charm lies a story that keeps the locals up at night. For years, staff have reported hearing faint whispers, footsteps on the upper floors after closing time, and books tumbling off the shelves with no one nearby.\\n\\nLibrarian May Collins, who has worked at Kensington for over two decades, recalls locking up one evening only to hear the distinct sound of pages turning upstairs. 'I thought a student had stayed behind,' she said, 'but when I went to check, the room was completely empty.'\\n\\nParanormal investigators who visited the library in 2023 claimed to capture EVP (electronic voice phenomena) recordings of a child's laughter echoing through the stacks. While skeptics chalk it up to creaky old floors and overactive imaginations, the mystery remains unsolved. Would you dare stay alone in the Kensington Library after dark?",
        "tags": "[\"Mystery\",\"Haunted\",\"Library\",\"Paranormal\"]",
        "sources": "- https:\/\/spookyarchives.com\/library-hauntings\r\n- Interview with Librarian May Collins, April 2025",
        "featuredImage": "story_680ae37ed179f5.53485317.jpeg",
        "createdAt": "2025-04-25 01:21:02",
        "updatedAt": "2025-04-25 01:21:02",
        "userId": "mh_6806c81e2f7972.38649556",
        "status": "published",
        "comments": [
            {
                "id": "comment_68116a72c7cc0",
                "userId": "mh_6806c81e2f7972.38649556",
                "username": "amelie.ng23",
                "userAvatar": "..\/..\/profile_pics\/profile_680853d478e693.35727743.jpg",
                "content": "THIS IS CRAZYYY",
                "createdAt": "2025-04-30 00:10:26"
            }
        ],
        "likes": 0,
        "views": 0,
        "author": "amelie.ng23"
    },
    {
        "id": "680fb2d0f2527",
        "title": "The Phantom of Willow Creek",
        "category": "unsolved-mysteries",
        "readTime": "7",
        "excerpt": "Locals claim to hear singing near the creek at night, but no one is ever there. Could the legend of the Phantom be real?",
        "content": "The Phantom of Willow Creek\r\n\r\nA Legend That Refuses to Die\r\n\r\nFor more than a hundred years, the quiet town of Willow Creek has been surrounded by eerie rumors and unsettling tales. Residents whisper of a mysterious figure seen near the water’s edge, often accompanied by the soft melody of a song carried through the night air. Despite numerous investigations, no one has been able to explain the strange happenings that occur along the creek after dark.\r\n\r\nThe Story Behind the Phantom\r\n\r\nAccording to local legend, the ghost is believed to be the spirit of Eleanor Whitmore, a young opera singer whose dreams were tragically cut short. It is said that Eleanor drowned in the creek one stormy night in 1895 while trying to save a stranded child. Since then, her sorrowful song is rumored to echo through the woods, especially on nights when the moon is full.\r\n\r\nParanormal Investigations and Sightings\r\n\r\nOver the years, several paranormal teams have visited Willow Creek, hoping to capture evidence of the Phantom. Some claim to have recorded unexplained audio — faint singing with no visible source. Others have reported sudden temperature drops and feelings of being watched while near the water. However, skeptics argue these are simply tricks of the environment and imagination.\r\n\r\nWould You Dare to Visit?\r\n\r\nDespite the lack of concrete proof, the legend of the Phantom continues to draw curious visitors and ghost hunters from across the country. Whether a restless spirit or just a local myth, the mystery of Willow Creek remains unsolved. So the question stands: Would you dare to visit Willow Creek under the light of the full moon?",
        "tags": "[\"Mystery\",\"Ghost\",\"Unsolved\",\"Paranormal\"]",
        "sources": "- https:\/\/phantomhistory.com\/willow-creek\\n- Local interviews with residents, March 2025",
        "featuredImage": "story_680fb2d0f1f167.80243488.jpeg",
        "createdAt": "2025-04-28 16:54:40",
        "updatedAt": "2025-04-28 16:54:40",
        "userId": "mh_6806c2a2decd47.24376293",
        "status": "published",
        "comments": [
            {
                "id": "comment_68102b69db6a9",
                "userId": "mh_6806c81e2f7972.38649556",
                "username": "amelie.ng23",
                "userAvatar": "..\/..\/profile_pics\/profile_680853d478e693.35727743.jpg",
                "content": "This gave me chills! I can't believe no one has solved it yet.",
                "createdAt": "2025-04-29 01:29:13"
            }
        ],
        "likes": 2,
        "views": 0,
        "author": "zoep_26",
        "authorAvatar": "..\/..\/assets\/images\/default-avatar.jpg"
    },
    {
        "id": "680fb77584bd7",
        "title": "The Disappearance at Hollow Pine Cabin",
        "category": "unsolved-mysteries",
        "readTime": "9",
        "excerpt": "Two hikers vanished near Hollow Pine Cabin in 1998, leaving behind only a single eerie photograph. Was it folklore, foul play, or something far more sinister?",
        "content": "The Disappearance at Hollow Pine Cabin\r\n\r\nLast Seen at Sunset\r\n\r\nIn the dense woods of Maine, there stands an old, rotting cabin known by locals as Hollow Pine. Over the years, many hikers and thrill-seekers have visited the site, drawn by tales of its tragic past — but not all who visit make it back. In October of 1998, a young couple, Elise Carter and Marcus Hale, set out to camp near the cabin. Witnesses reported seeing their campfire glowing at dusk. By morning, the fire was cold, their gear untouched, but the couple had vanished without a trace.\r\n\r\nClues That Lead Nowhere\r\n\r\nPolice found only one strange clue inside the cabin: a single Polaroid photograph resting on the mantel. The photo showed a blurry figure standing deep in the trees behind where the couple’s tent had been set up. No other evidence was recovered, and despite search parties and helicopters combing the area, Elise and Marcus were never found.\r\n\r\nLocal Lore or Something More Sinister?\r\n\r\nHollow Pine has long been surrounded by dark folklore. Some believe the area is cursed, tied to a 19th-century hermit who was accused of witchcraft and executed near the site. Others speak of a \"Watcher\" — an entity said to lure wanderers into the woods under the glow of the full moon.\r\n\r\nNew Sightings Stir Old Fears\r\n\r\nJust last year, a group of college students hiking near the cabin reported hearing faint whispers at night, though they saw no one. One student claims to have captured a figure on their phone’s camera, but the image is so pixelated it offers no real proof — only more questions.",
        "tags": "",
        "sources": "https:\/\/urbanlegendarchives.com\/hollow-pine-mystery\\n- Interview with local ranger Samuel McBride, March 2025",
        "featuredImage": "story_680fb775849485.34113864.png",
        "createdAt": "2025-04-28 17:14:29",
        "updatedAt": "2025-04-28 17:14:29",
        "userId": "mh_6806c2a2decd47.24376293",
        "status": "published",
        "comments": [
            {
                "id": "comment_680fe125e0771",
                "userId": "mh_6806c2a2decd47.24376293",
                "username": "zoep_26",
                "userAvatar": "..\/..\/profile_pics\/profile_680fb1aa183a20.27378666.jpg",
                "content": "Cool",
                "createdAt": "2025-04-28 20:12:21"
            },
            {
                "id": "comment_68102b9b6c98e",
                "userId": "mh_6806c81e2f7972.38649556",
                "username": "amelie.ng23",
                "userAvatar": "..\/..\/profile_pics\/profile_680853d478e693.35727743.jpg",
                "content": "I grew up near a place like this... the stories were so similar. Creepy!",
                "createdAt": "2025-04-29 01:30:03"
            },
            {
                "id": "comment_6812562f4ae47",
                "userId": "mh_68022620279ac1.75169646",
                "username": "michelle123",
                "userAvatar": "..\/..\/profile_pics\/profile_680940a355f736.27582336.jpeg",
                "content": "omg now i wanna visit hehe!",
                "createdAt": "2025-04-30 16:56:15"
            }
        ],
        "likes": 0,
        "views": 0,
        "author": "zoep_26",
        "authorAvatar": "..\/..\/profile_pics\/profile_680fb1aa183a20.27378666.jpg"
    },
    {
        "id": "680feb7662265",
        "title": "The Shadow at Blackwood Bridge",
        "category": "unsolved-mysteries",
        "readTime": "6",
        "excerpt": "Locals avoid Blackwood Bridge after sunset, claiming to see a shadowy figure standing silently at the center of the bridge. No one knows who — or what — it is.",
        "content": "The Shadow at Blackwood Bridge\r\n\r\nA Silent Watcher in the Night:\r\n\r\nNestled on the outskirts of Harrow’s Field, Blackwood Bridge is nothing more than an aging wooden structure by day — a place where children once fished and couples strolled hand-in-hand. But as the sun sinks beneath the horizon, the bridge transforms. Locals claim that at nightfall, a tall shadowy figure appears at the bridge’s center, unmoving, shrouded in darkness, as though waiting.\r\n\r\nFor nearly a century, this figure has haunted the stories passed down through generations. Those brave enough to venture near after dark speak of a presence so heavy it feels like the air itself is pressing against their skin. The figure doesn’t chase or attack. It simply stands. Watching.\r\n\r\nThe First Disappearance:\r\n\r\nThe legend traces back to the winter of 1937, when a young woman named Eleanor Bryce vanished while walking home across the bridge after visiting her sister. Her footprints were found in the fresh snow, leading onto the bridge — but none on the other side. Search parties scoured the icy waters below for weeks, but no trace of Eleanor was ever found.\r\n\r\nHer disappearance was written off as an accident. But within months, another person went missing. And then another.\r\n\r\nEyewitness Testimonies: \r\n\r\nIn 1975, Jacob Millner, a retired railroad worker, claimed he saw the shadow up close. He described it as \"a man, or something shaped like a man, wearing a wide-brimmed hat, standing still like a statue.\" Jacob swore that as he walked closer, the humming of an old lullaby filled the air, though no lips moved. He ran home and refused to ever cross the bridge again.\r\n\r\nMultiple accounts over the years echo Jacob’s description — the hat, the stillness, the humming. Some witnesses claim the figure disappears the moment you try to confront it. Others say they felt paralyzed by fear, unable to look away.\r\n\r\nEyewitness Testimonies:\r\n\r\nIn 1975, Jacob Millner, a retired railroad worker, claimed he saw the shadow up close. He described it as \"a man, or something shaped like a man, wearing a wide-brimmed hat, standing still like a statue.\" Jacob swore that as he walked closer, the humming of an old lullaby filled the air, though no lips moved. He ran home and refused to ever cross the bridge again.\r\n\r\nMultiple accounts over the years echo Jacob’s description — the hat, the stillness, the humming. Some witnesses claim the figure disappears the moment you try to confront it. Others say they felt paralyzed by fear, unable to look away.\r\n\r\nThe Warning That Remains:\r\n\r\nLocal folklore warns: If you see the figure, do not speak to it. Do not acknowledge it. Keep your head down, and walk away.\r\n\r\nNo one knows what happens if you disobey the warning. But those who’ve crossed the bridge at night say the shadow is always there, waiting.",
        "tags": "[\"Mystery\",\"Paranormal\",\"Ghost Story\",\"Unsolved\"]",
        "sources": "- https:\/\/mysteryarchives.com\/blackwood-bridge-legend\r\n- Interview with resident Clara Mason, February 2025",
        "featuredImage": "story_680feb7661f520.03973290.jpeg",
        "createdAt": "2025-04-28 20:56:22",
        "updatedAt": "2025-04-29 16:14:21",
        "userId": "mh_6806c2a2decd47.24376293",
        "status": "published",
        "comments": [
            {
                "id": "comment_68102b0ec8aec",
                "userId": "mh_6806c81e2f7972.38649556",
                "username": "amelie.ng23",
                "userAvatar": "..\/..\/profile_pics\/profile_680853d478e693.35727743.jpg",
                "content": "Wow such a spooky story.",
                "createdAt": "2025-04-29 01:27:42"
            }
        ],
        "likes": 6,
        "views": 0,
        "author": "zoep_26",
        "authorAvatar": "..\/..\/profile_pics\/profile_680fb1aa183a20.27378666.jpg"
    },
    {
        "id": "6810fde647d66",
        "title": "cbnsbcbbcs",
        "category": "true-crime",
        "readTime": "7",
        "excerpt": "vb abaajnvabjvjka",
        "content": " vdbddfdjbksjksjk",
        "tags": "[\"bsdbc s\"]",
        "sources": "cwbabab",
        "featuredImage": "story_6810fde647b9e7.60221764.png",
        "createdAt": "2025-04-29 16:27:18",
        "updatedAt": "2025-04-29 16:27:18",
        "userId": "mh_6806c2a2decd47.24376293",
        "status": "published",
        "comments": [],
        "likes": 0,
        "views": 0,
        "author": "zoep_26",
        "authorAvatar": "..\/..\/profile_pics\/profile_680fb1aa183a20.27378666.jpg"
    },
    {
        "id": "68118ce8c0bc8",
        "title": "Knnives Out (IRL)",
        "category": "unsolved-mysteries",
        "readTime": "4",
        "excerpt": "The circumstances surrounding the death of crime novelist Harlan Thrombey are mysterious, but there's one thing that renowned Detective Benoit Blanc knows for sure.....",
        "content": "A housekeeper, Fran, carries a breakfast tray through an expansive mansion, full of quirky antiques, display knives, and mystery novels, to the novels’ elderly author Harlan Thrombey (Christopher Plummer). He’s not in his bedroom, so she goes up a hidden staircase to his study. She discovers Harlan’s body, in repose on his couch, covered in blood. His throat’s been slit. She curses and drops the tray.\r\n\r\nA week later, after Harlan’s funeral, a young woman named Marta (Ana de Armas) wakes up in a panic in the bedroom of her family’s house. Her sister calls her down for breakfast and says Marta needs to go back to the Thrombey home that day. Marta was Harlan’s personal registered nurse, and investigators want to speak to her about his death. Marta was also invited to the memorial, which also happens to be that day. At breakfast, Marta’s mother tells off her sister for playing a show about murder on her laptop. Marta insists it isn’t a big deal, but it’s clear the show upset her.\r\n\r\nMarta drives her beater car to the Thrombey mansion and is welcomed warmly by the family. We then meet the family as they are questioned by the investigators, who are Lt. Elliot, Trooper Wagner, and a mysterious figure sitting by the piano, randomly playing a high note to rattle the interviewees every so often. He eventually introduces himself as famed private investigator Benoit Blanc (Daniel Craig).\r\n\r\nFirst, they question Linda Drysdale (Jamie Lee Curtis), Harlan’s eldest daughter. Linda owns her own company and is very clear she’s the one who runs it, her husband Richard (Don Johnson) merely helping. We discover through her that Harlan was killed on the evening after a party for his 85th birthday. Linda insists she and Harlan had a good relationship, but her terse tone and measured words mean we are not so sure she is truthful. But she recalls her brother Walt (Michael Shannon) had an argument with Harlan at the party. She also has a low opinion of Walt’s son Jacob, who is always on his phone being an alt-right troll on social media. (The entire family refers to him as a Nazi.)\r\n\r\nUnder questioning, Walt remembers that argument – Harlan wanted to let Walt go from the publishing company that Walt runs on behalf of his father. Walt anxiously asks Harlan if he is being fired, but Harlan pats his cheek and says they’ll talk about it the next day. But Walt tells the investigators something less serious. In turn, Walt accuses Richard of also having an argument with Harlan the night of the party in his office, overhearing Harlan exclaim, “You tell her, or I will!”\r\n\r\nRichard remembers that argument, recollecting that Harlan had shown him incriminating photos of him cheating on Linda. Harlan says he’ll give Linda a letter in a purple envelope, telling her everything, unless Richard tells her himself. But Richard tells the investigators that “You tell her, or I will!” was in reference to putting Harlan’s mother “Great Nana” in a nursing home.\r\n\r\nWe also meet Joni Thrombey (Toni Collette), who is a widower of another of Harlan’s sons. She is a spiritual lifestyle guru and tells the investigators that she’s still very close to the family, even after her husband’s death. However, the audience sees that Joni is barely tolerated at family gatherings. Harlan pays Joni’s daughter Meg’s tuition at college.\r\n ",
        "tags": "",
        "sources": "https:\/\/themoviespoiler.com\/movies\/knives-out\/",
        "featuredImage": "story_68118ce8c07516.49914541.jpg",
        "createdAt": "2025-04-30 02:37:28",
        "updatedAt": "2025-04-30 02:37:28",
        "userId": "mh_68022620279ac1.75169646",
        "status": "published",
        "comments": [],
        "likes": 0,
        "views": 0,
        "author": "michelle123",
        "authorAvatar": "..\/..\/profile_pics\/profile_680940a355f736.27582336.jpeg"
    },
    {
        "id": "68118ec23bdf4",
        "title": "Who is Momo?",
        "category": "conspiracies",
        "readTime": "3",
        "excerpt": "Momo? A hoax of course.  ...or is it?",
        "content": "ast week I received an email from my children’s school with the subject header: Momo – Please be Aware. The message warned of sinister videos targeting young people online which are “promoting children to do dangerous tasks without telling their parents (it threatens to hurt the viewer if they do not keep it a secret. Examples we have noticed in school include asking children to turn the gas on or to find and take tablets.”\r\n\r\nThree hours later the school sent another email, saying that many parents had been in touch telling them that Momo was a hoax. The school pointed out that they were responding to guidance from the local authority, and that they have had pupils report Momo incidents to them verbally.\r\n\r\nWell, of course Momo is a hoax. Because if it were real it would mean that some kind of supernatural being with exaggerated round eyes, a sinister smile and lank, dark hair was somehow infiltrating the internet and telling children to harm themselves.\r\n\r\nMomo first came to prominence in July last year, when a YouTuber called Reignbot talked about some mysterious figure who was contacting teenagers via WhatsApp and other social media platforms. It was initially of the challenge variety; fulfil a task or series of tasks, failure to do so will result in harm or bad luck befalling you....",
        "tags": "[\"Theory\",\"Mystery\",\"Internet\"]",
        "sources": "https:\/\/www.independent.co.uk\/news\/long_reads\/momo-challenge-internet-viral-hoax-parents-a8806836.html",
        "featuredImage": "story_6811926358b508.77481543.jpg",
        "createdAt": "2025-04-30 02:45:22",
        "updatedAt": "2025-04-30 03:00:51",
        "userId": "mh_68022620279ac1.75169646",
        "status": "published",
        "comments": [],
        "likes": 0,
        "views": 0,
        "author": "michelle123",
        "authorAvatar": "..\/..\/profile_pics\/profile_680940a355f736.27582336.jpeg"
    },
    {
        "id": "681247bb8f14e",
        "title": "THE TOP DOG",
        "category": "serial-killers",
        "readTime": "1",
        "excerpt": "This is a story by aZ_123... about top dog skrilla",
        "content": "Top dog Skrilla was a top dog. End of Story",
        "tags": "[\"Killers\"]",
        "sources": "",
        "featuredImage": "story_681247bb8e80e7.26219538.jpeg",
        "createdAt": "2025-04-30 15:54:35",
        "updatedAt": "2025-04-30 15:54:35",
        "userId": "admin",
        "status": "published",
        "comments": [
            {
                "id": "comment_68124bcc31e09",
                "userId": "admin",
                "username": "Anonymous",
                "userAvatar": "..\/..\/assets\/images\/default-avatar.jpg",
                "content": "oop..",
                "createdAt": "2025-04-30 16:11:56"
            },
            {
                "id": "comment_68124be96ab68",
                "userId": "mh_68022620279ac1.75169646",
                "username": "michelle123",
                "userAvatar": "..\/..\/profile_pics\/profile_680940a355f736.27582336.jpeg",
                "content": "top DAAWWGGGG",
                "createdAt": "2025-04-30 16:12:25"
            }
        ],
        "likes": 3,
        "views": 0,
        "author": "Anonymous",
        "authorAvatar": "..\/..\/assets\/images\/default-avatar.jpg"
    }
]